# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 20  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
  - [16,23, 35,43, 49,101]  # P3/8
  - [100,77, 108,163, 237,188]  # P4/16

# YOLOv5 v6.0 backbone
backbone:
  #! [from, number, module, args]  number是指该模块内网络层数重复的次数
  [[-1, 1, CBL, [1, 16, 3, 2, 1, 1, 1, 1]],   # 0   stride 2
   [-1, 1, DW, [1, 8, 16, 1]],
   [-1, 1, DWRes, [1, 8, 16]],
   [-1, 1, DW, [1, 16, 48, 2]],     # 3     stride 4
   [-1, 1, DWRes, [1, 16, 64]],
   [-1, 1, DWRes, [1, 16, 64]],
   [-1, 1, DW, [1, 16, 64, 2]],     # 6      stride 8
   [-1, 1, DWRes, [1, 16, 96]],
   [-1, 1, DWRes, [1, 16, 96]],
   [-1, 1, DW, [1, 32, 96, 1]],
   [-1, 1, DWRes, [1, 32, 192]],
   [-1, 1, DWRes, [1, 32, 192]],
   [-1, 1, DWRes, [1, 32, 192]],
   [-1, 1, DWRes, [1, 32, 192]],
   [-1, 1, DW, [1, 48, 192, 2]],    # 14     stride  16
   [-1, 1, DWRes, [1, 48, 272]],
   [-1, 1, DWRes, [1, 48, 272]],
   [-1, 1, DWRes, [1, 48, 272]],
   [-1, 1, DWRes, [1, 48, 272]],
   [-1, 1, CBL, [1, 272, 1, 1, 0, 1, 1, 1]],      # 19 FPN
   [-1, 1, CBL, [1, 272, 3, 2, 1, 272, 1, 1]],     # 20   stride 32
   [-1, 1, CBL, [1, 96, 1, 1, 0, 1, 1, 1]],
   [-1, 1, DWRes, [1, 96, 448]],
   [-1, 1, DWRes, [1, 96, 448]],
   [-1, 1, DWRes, [1, 96, 448]],
   [-1, 1, DWRes, [1, 96, 448]],
   [-1, 1, DWRes, [1, 96, 448]],
   [-1, 1, CBL, [1, 126, 1, 1, 0, 1, 1, 1]],   # 27     FPN
   [-1, 1, CBL, [1, 126, 5, 1, 2, 126, 1, 1]],
   [-1, 1, OrthoConv, [1]],
        # 31  yolo


   [27, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 19], 1, Concat, [1]],
   [-1, 1, CBL, [1, 96, 1, 1, 0, 1, 1, 1]],
   [-1, 1, CBL, [1, 96, 5, 1, 2, 96, 1, 1]],
   [-1, 1, OrthoConv, [1]],     # 38

  ]

# YOLOv5 v6.0 head
head:
  [[[34, 29], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
