# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 20  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
  - [14,19, 29,31, 34,71]  # P3/8
  - [81,62, 64,130, 103,161]  # P4/16
  - [186,107, 156,211, 260,198]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  #! [from, number, module, args]  number是指该模块内网络层数重复的次数
  [[-1, 1, CBL, [1, 16, 3, 2, 1, 1, 1, 1]],   # 0   stride 2
   [-1, 1, DW, [1, 8, 16, 1]],
   [-1, 1, DWRes, [1, 8, 16]],
   [-1, 1, DW, [1, 16, 48, 2]],     # 3   stride 4
   [-1, 1, DWRes, [1, 16, 64]],
   [-1, 1, DWRes, [1, 16, 64]],
   [-1, 1, DW, [1, 16, 64, 2]],     # 6   stride 8
   [-1, 1, DWRes, [1, 16, 96]],
   [-1, 1, DWRes, [1, 16, 96]],
   [-1, 1, DW, [1, 32, 96, 1]],
   [-1, 1, DWRes, [1, 32, 192]],
   [-1, 1, DWRes, [1, 32, 192]],
   [-1, 1, DWRes, [1, 32, 192]],
   [-1, 1, DWRes, [1, 32, 192]],    # 13   stride 8
   [-1, 1, DW, [1, 48, 192, 2]],
   [-1, 1, DWRes, [1, 48, 272]],
   [-1, 1, DWRes, [1, 48, 272]],
   [-1, 1, DWRes, [1, 48, 272]],
   [-1, 1, DWRes, [1, 48, 272]],    # FPN  18    stride 16
   
   [-1, 1, DW, [1, 96, 272, 2]],
   [-1, 1, DWRes, [1, 96, 448]],
   [-1, 1, DWRes, [1, 96, 448]],
   [-1, 1, DWRes, [1, 96, 448]],
   [-1, 1, DWRes, [1, 96, 448]],
   [-1, 1, DWRes, [1, 96, 448]],
   [-1, 1, SPPNet, [[3, 5, 9]]],
   [-1, 1, CBL, [1, 96, 1, 1, 0, 1, 1, 1]],   # FPN  26

  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, CBL, [1, 96, 5, 1, 2, 96, 1, 1]],
   [-1, 1, CBL, [1, 96, 1, 1, 0, 1, 1, 0]],
   [-1, 1, CBL, [1, 96, 5, 1, 2, 96, 1, 1]],
   [-1, 1, CBL, [1, 96, 1, 1, 0, 1, 1, 0]],   # 30  stride 32

   [26, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 18], 1, Concat, [1]],
   [-1, 1, SPPNet, [[3, 5, 9]]],
   [-1, 1, CBL, [1, 144, 1, 1, 0, 1, 1, 1]],

   [-1, 1, CBL, [1, 144, 5, 1, 2, 144, 1, 1]],
   [-1, 1, CBL, [1, 144, 1, 1, 0, 1, 1, 0]],
   [-1, 1, CBL, [1, 144, 5, 1, 2, 144, 1, 1]],
   [-1, 1, CBL, [1, 144, 1, 1, 0, 1, 1, 0]],      # 38   stride 16

   
   [34, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 13], 1, Concat, [1]],
   [-1, 1, CBL, [1, 176, 5, 1, 2, 176, 1, 1]],
   [-1, 1, CBL, [1, 176, 1, 1, 0, 1, 1, 0]],
   [-1, 1, CBL, [1, 176, 5, 1, 2, 176, 1, 1]],
   [-1, 1, CBL, [1, 176, 1, 1, 0, 1, 1, 0]],      

   [[44, 38, 30], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
